/**
 * Created by apple on 2017/7/17.
 */
const initialSate = {
    book:{

    },
    loveList:[
        {
            id:11,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，最..."
        },
        {
            id:121,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地最..."
        },
        {
            id:131,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，最..."
        },
        {
            id:141,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，最..."
        },
        {
            id:151,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，最..."
        },
        {
            id:161,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，最..."
        },
        {
            id:11,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，最..."
        },
        {
            id:171,
            imgUrl:"",
            name:"外星失落的少女",
            author:"默默",
            info:"本是一个星球最尊贵的公主，却因为家族被掠夺者洗劫一空，而与亲人失去了联系，独自一人流落在一个荒岛之中，后来被神秘人阴差阳错的带往地球，最..."
        }

    ]
}

function bookInfo(state = initialSate,action){
    switch (action.type){
        case "BOOK_INFO_HANDLE":
            return Object.assign({},state,action.data)

        default :
            return state
    }
}

export default bookInfo;